
# %%

q = '달리기 시합에서 남준이는 2등을 했고, 윤기는 4등을 했습니다. 호석이는 윤기보다 잘했지만 남준이보다는 못했습니다. 호석이의 등수는 몇 등입니까?'
q = '알 수 없는 수를 11로 나누면 몫이 3이고 나머지가 8입니다. 알 수 없는 수는 얼마입니까?'
q = '서로 다른 두 자연수 A, B가 있습니다. A+B=30, A=B+B+B+B일 때, A와 B의 합은 얼마입니까?'
q = '두 자리 수의 덧셈식 A4+2B=69에서 A에 해당하는 숫자를 쓰시오.'
q = '1, 17, 33, 49, 65와 같은 규칙에서 25번째 놓일 수와 40번째 놓일 수를 각각 A와 B라 할 때, A-B를 구하시오.'
q = '높이가 4.5m인 육교가 있습니다. 다섯 대의 자동차의 높이가 3.5m, 4.0m, 5.0m, 5.1m, 5.2m 일 때, 육교를 통과할 수 있는 자동차는 모두 몇 대입니까?'
q = '83471, 92730, 70006, 30257, 67805 중에서 숫자 7이 70000을 나타내는 수는 어느 것입니까?'
q = '올림하여 십의 자리까지 나타내면 140이 되는 자연수 중에서 가장 큰 수를 쓰시오.'
q = '지민은 하루에 달리기를 240m를 합니다. 미나가 1주일 동안 달리는 거리는 몇 km입니까?'
q = '지민이네 학교 4학년 학생 319명에게 공책을 한 권씩 나누어 주려고 합니다. 공책을 10권씩 묶음으로만 팔면 공책을 몇 권 사야 합니까?'
q = '정국이네 반 학생은 모두 36명입니다. 그 중의 1/4은 안경을 쓰고, 안경을 쓴 학생의 2/3가 남학생입니다. 안경을 쓴 남학생은 몇 명입니까?'
q = '일정한 빠르기로 타는 양초가 있습니다. 이 양초에 불을 붙인 다음 28분이 지난 후 양초의 길이를 재어 보니 처음 길이의 5/12가 남았습니다. 남은 양초가 모두 다 타려면 앞으로 몇 분이 더 걸립니까?'
q = '1m의 14/25는 몇 cm인지 구하시오.'
q = '지민이의 하루 식사 시간은 24시간 중에서 1/6만큼입니다. 정국이의 하루 식사 시간은 24시간 중에서 1/8만큼입니다. 누구의 식사 시간이 더 깁니까?'
q = '정국이는 미술 시간에 철사 35cm의 3/5을 사용했습니다. 사용하고 남은 철사는 몇 cm일까요?'
q = '서로 다른 두 자연수 A, B가 있습니다. A+B=30, A=B+B+B+B일 때, A를 B로 나눈 나머지를 구하시오.'
q = '정국이네 반 학급 문고에는 동화책이 267권, 위인전이 312권 있습니다. 학급 문고에 있는 동화책과 위인전은 모두 몇 권입니까?'
q = '길이가 352cm인 끈과 516cm인 끈이 있습니다. 두 끈의 길이의 합은 몇 cm입니까?'
q = '여행에 신청한 남자 어린이는 324 명, 여자 어린이는 315 명입니다. 여행에 신청한 어린이는 모두 몇 명입니까?'
q = '정국이는 종이학 3 마리를 접는 데 138 초가 걸립니다. 정국이가 종이학 18 마리를 접는 데 걸리는 시간은 몇 초입니까?'
q = '오리가 5마리 있다. 닭은 2마리가 있다. 토끼는 3마리가 있을 때, 동물은 모두 몇 마리 입니까?'
q = '액자의 길이는 13/20m입니다. 13/20m는 몇 cm인지 구하시오.'
q = '6보다 1 큰 수는 얼마입니까?'
q = '(가), (나), (다), (라) 4개의 상자가 있습니다. (나) 상자는 (라) 상자보다 큽니다. (가) 상자는 (라) 상자보다 작습니다. (나) 상자는 (다) 상자보다 작습니다. 크기가 가장 작은 상자는 무엇입니까?'
q = 'A를 8로 나누면 몫은 B이고 나머지는 C가 됩니다. 이 식에서 몫이 3이고 나머지가 7일 때, A+3의 값을 구하시오.'
q = '4보다 작은 자연수들의 합을 구해보시오.'
q = '관광객을 태운 기차가 목적지를 향해 가고 있습니다. 중간에 있는 역에서 174명이 내리고 219명이 더 탔습니다. 목적지에서 346명이 내렸다면, 기차에 처음 타고 있었던 사람은 몇 명입니까?'
q = 'A를 8로 나누면 몫은 B이고 나머지는 C가 됩니다. A, B, C는 자연수입니다. 이 식에서 몫과 나머지가 같습니다. 나누어지는 수 A 중 가장 큰 수를 구하시오.'
q = 'A의 값이 3일 때, A*2는 얼마입니까?'
q = '5개의 수 7, 6, 2, 3, 5에서 홀수를 모두 찾아 합을 구하시오.'
q = '4개의 숫자 9, 6, 7, 8이 있습니다. 짝수를 더한 값은 얼마인지 구하시오.'
q = 'A는 33보다 22만큼 작은 수입니다. A의 값을 구하시오.'
q = '4개의 수 314, 425, 602, 369가 있습니다. 차가 가장 크게 되는 두 수를 찾아 그 차를 구하시오.'
q = '19 이상 22 이하인 수는 모두 몇 개입니까?'
q = '두 수 241과 516의 차는 얼마입니까?'
q = '40000원을 1000원짜리 지폐로 바꾸면 몇 장입니까?'
q = '똑같은 컵에 물을 가득 채워 (가) 그릇에는 5번, (나) 그릇에는 6번을 부었더니 물이 가득 찼습니다. 물을 더 적게 담을 수 있는 그릇의 기호를 쓰시오.'
q = '쿠키를 유정이는 2개 먹었고 유나는 유정이보다 4개 더 많이 먹었습니다. 유정이와 유나가 먹은 쿠키는 모두 몇 개입니까?'
q = '자석을 정국이는 4개, 유정이는 8개 가지고 있습니다. 유정이는 정국이보다 자석을 몇 개 더 많이 가지고 있습니까?'
q = '과수원에서 복숭아를 정국이는 8개, 유정이는 9개, 유나는 6개 땄습니다. 복숭아를 가장 적게 딴 사람은 누구입니까?'
q = '529*83은 얼마입니까?'
q = '정국이는 4와 4를 모았습니다. 지민이는 3과 6을 모았습니다. 누가 모은 수가 더 큽니까?'
q = '어떤 수에서 30을 빼면 11입니다. 어떤 수는 얼마입니까?'
q = '어떤 수에서 36을 빼야 하는데 잘못하여 63을 뺀 결과가 8이 나왔습니다. 올바른 값을 구하시오.'
q = '어떤 소수의 소수점을 오른쪽으로 한 자리 옮기면 원래보다 2.7만큼 커집니다. 원래의 소수를 구하시오.'
q = '3개의 수 2, 3, 9로 나누어 떨어질 수 있는 세 자리 수 중에서 가장 큰 수와 가장 작은 수의 합은 얼마입니까?'
q = '3개의 수 2, 3, 9로 나누어 떨어질 수 있는 세 자리 수는 모두 몇 개 있습니까?'

q = '6보다 1 큰 수는 얼마입니까?'
q = '목장에 양이 4마리, 염소가 3마리 있습니다. 목장에 있는 양와 염소는 모두 몇 마리입니까?'
q = '어느 동물원에 염소가 7마리, 코끼리는 5마리 있습니다. 염소는 코끼리보다 몇 마리 더 많습니까?'
q = '어느 동물원에 사자는 5마리 있고 호랑이는 사자보다 1마리 더 많다면 호랑이는 몇 마리 있습니까?'
q = '4개의 수 3, 6, 1, 9를 작은 수부터 순서대로 늘어놓을 때, 3번째에 놓이는 수를 구하시오.'
q = '4개의 수 3, 6, 1, 9를 큰 수부터 순서대로 늘어놓을 때, 오른쪽에서 1번째에 놓이는 수를 구하시오.'
q = '버스에 9명이 타고 있었는데 정류장에서 4명이 내렸습니다. 버스에 남은 사람은 몇 명입니까?'
q = '유정이는 색연필을 4자루 가지고 있습니다. 오늘 선생님께 3자루를 상으로 받았다면 유정이가 가진 색연필은 모두 몇 자루입니까?'
q = '유나는 사탕을 8개 가지고 있었는데 2개를 먹고 3개를 동생에게 주었습니다. 유나에게 남은 사탕은 몇 개입니까?'
q = '유정이는 위인전을 4권, 동화책을 6권, 만화책을 8권 읽었습니다. 유정이가 읽은 책은 모두 몇 권입니까?'
q = '만두를 유정이는 8개 빚었고, 어머니는 유정이보다 3개 더 빚었습니다. 어머니가 빚은 만두는 모두 몇 개입니까?'
q = '5개의 수 7, 6, 2, 3, 5에서 3으로 나누어 떨어지는 수는 모두 몇 개입니까?'
q = '19보다 크고 22보다 작은 수는 모두 몇 개입니까?'

q = '운동장에 여학생 3명, 남학생 7명이 있습니다. 운동장에 있는 학생은 모두 몇 명입니까?'
q = '어떤 수에서 36을 빼야 하는데 잘못하여 63을 뺀 결과가 8이 나왔습니다. 바르게 계산한 결과를 구하시오.'
q = '바구니에 사과가 9개 있습니다. 이 중에서 유정이가 3개, 유나가 4개를 꺼내 먹었습니다. 바구니에 남아 있는 사과는 모두 몇 개입니까?'
q = '유정이는 장미 4송이, 국화 5송이, 튤립 5송이로 꽃다발을 만들었습니다. 유정이가 만든 꽃다발의 꽃은 모두 몇 송이입니까?'

q = '어머니는 쌀을 씻는 데 5l 의 물을 사용하고, 아버지는 4900ml 의 물을 사용했다고 합니다. 물을 더 많이 사용한 사람은 누구입니까?'
q = '어머니는 쌀을 씻는 데 5l 의 물을 사용하고, 아버지는 4900ml 의 물을 사용했다고 합니다. 물을 더 적게 사용한 사람은 누구입니까?'
q = '어머니는 쌀을 씻는 데 5l 의 물을 사용하고, 아버지는 4900ml 의 물을 사용했다고 합니다. 어머니는 몇 l의 물을 사용했습니까?'
q = '상자에 밤이 1000 개씩 들어 있습니다. 밤이 20 상자이면 모두 몇 개입니까?'

q = '5장의 숫자 카드 4, 7, 8, 3, 0을 한 번씩 사용하여 만들 수 있는 다섯 자리 수 중 만의 자리 숫자가 4 인 가장 큰 수를 구하시오.'
q = '4개의 숫자 7, 2, 5, 9를 한 번씩만 사용하여 네 자리 수를 만들려고 합니다. 만들 수 있는 네 자리 수는 모두 몇 개입니까?'

q = '지민은 하루에 달리기를 240m를 합니다. 지민이가 1주일 동안 달리는 거리는 몇 km입니까?'
q = '누름 못이 한 상자에 10000 개씩 들어 있습니다. 누름 못이 2상자이면 몇 개입니까?'
q = '어떤 소수의 소수점을 오른쪽으로 한 자리 옮기면 원래보다 2.7만큼 커집니다. 원래의 소수를 구하시오.'
q = '어떤 소수의 소수점을 오른쪽으로 두 자리 옮기면 원래보다 1221.66만큼 커집니다. 원래의 소수를 구하시오.'
q = '어떤 소수의 소수점을 왼쪽으로 한 자리 옮기면 원래보다 11.106만큼 작아집니다. 원래의 소수를 구하시오.'

q = '농장에서 닭이 달걀을 어제 9700 개를 낳았고 오늘 300 개를 낳았습니다. 달걀은 모두 몇 개입니까?'
q = '10000이 5개, 1000이 22개, 100이 34개, 10이 18개, 1이 305개인 수는 얼마입니까?'
q = '3이 5개인 수는 얼마입니까?'
q = '5장의 숫자 카드 4, 7, 8, 3, 0을 한 번씩 사용하여 만들 수 있는 다섯 자리 수 중 100의 자리 숫자가 4 인 가장 큰 수를 구하시오.'

q = '네 개의 수 309, 54, 91, 636이 있을 때, 가장 큰 수와 가장 작은 수의 곱을 구하시오.'
q = '숫자 카드 2, 0, 4, 9, 7을 한 번씩만 써서 가장 큰 다섯 자리 수를 만들어 보시오.'
q = '숫자 카드 2, 0, 4를 한 번씩만 써서 가장 큰 세 자리 수를 만들어 보시오.'

q = '두 수 60과 700의 곱을 구하시오.'

q = '정국이는 저금통에 50원짜리 동전이 400개가 있습니다. 정국이가 가지고 있는 돈은 얼마입니까?'
q = '정국이는 저금통에 50원짜리 동전 400개가 있고, 유정이는 저금통에 100원짜리 동전 90개가 있습니다. 누가 더 적은 돈을 가지고 있습니까?'
q = '정국이는 저금통에 50원짜리 동전 400개가 있고, 유정이는 저금통에 100원짜리 동전 90개가 있습니다. 정국이와 유정이가 가지고 있는 돈의 합은 얼마입니까?'
q = '정국이는 100원짜리 동전을 253개 모았고, 유정이는 50원짜리 동전을 674개 모았습니다. 누가 더 조금 모았습니까?'

q = '47과 381이 있을 때, 큰 수를 작은 수로 나눈 몫을 구하시오.'
q = '47과 381이 있을 때, 큰 수를 작은 수로 나눈 나머지를 구하시오.'

q = '공깃돌 438 개를 32 명의 학생에게 똑같이 나누어 주려고 합니다. 한 학생에게 몇 개까지 나누어 줄 수 있습니까?'
q = '윤기는 네 자리 수와 두 자리 수의 뺄셈을 하려 합니다. 윤기는 네 자리 수의 일의 자리 숫자 9를 6으로 잘못 보았고, 두 자리 수의 십의 자리 숫자와 일의 자리 숫자를 바꾸어 75라고 잘못 보았습니다. 윤기가 구한 차는 1821 일 때, 바르게 계산한 결과를 구하시오.'
q = '어떤 수에서 46을 뺐더니 15가 되었습니다. 어떤 수에서 29를 빼면 얼마가 되는지 구하시오.'
q = '1, 5, 14, 30, 55, 91과 같은 규칙으로 수를 배열하고 있습니다. 9번째 수는 무엇입니까?'
q = '1, 17, 33, 49, 65와 같은 규칙에서 25번째 놓일 수와 40번째 놓일 수를 각각 A와 B라 할 때, B-A를 구하시오.'
q = '1, 17, 33, 49, 65와 같은 규칙에서 2번째 놓일 수를 구하시오.'
q = '1, 17, 33, 49, 65와 같은 규칙에서 25번째 놓일 수와 40번째 놓일 수를 각각 A와 B라 할 때, B-A를 구하시오.'
q = '자연수를 규칙에 따라 4, 7, 10, A, 16, 19, B로 배열하였습니다. B와 8의 곱을 구하시오.'

q = '어느 학교의 학생은 249 명입니다. 한 반의 학생 수를 31 명으로 한다면 모두 몇 반이 되겠습니까?'
q = '사과 360개를 한 상자에 40개씩 담았습니다. 사과를 담은 상자는 모두 몇 개입니까?'
q = '상자 안에 9개의 공이 있습니다. 석진이가 5개의 공을 상자에서 꺼냈습니다. 상자 안에 있는 공은 모두 몇 개입니까?'
q = '상자 안에 9개의 공이 있습니다. 석진이가 5개의 공을 상자에 더 넣었습니다. 상자 안에 있는 공은 모두 몇 개입니까?'

q = '규칙에 따라 수를 5018, 5118, A, 5618, 6018, B와 같이 배열하였습니다. A와 B의 합을 구하시오.'
q = '규칙적인 수의 배열 150, 350, 750, 1350, A, 3150에서 A의 값을 구하시오.'


q = '길이가 352cm인 끈과 516cm인 끈이 있습니다. 두 끈의 길이의 합은 몇 cm입니까?'

q = '유정이의 키는 1 m 35cm 입니다. 유정이의 키는 몇 m입니까?'
q = '유정이의 키는 1m 35cm 이고, 유나의 키는 유정이보다 9cm 더 작다고 합니다. 유나의 키는 몇 cm입니까?'
q = '유정이의 키는 1.56m 입니다. 유나는 유정이보다 14cm 작고 정국이는 유나보다 0.27m 크다고 합니다. 정국이의 키는 몇 cm입니까?'

q = '1 부터 6 까지의 자연수의 평균은 얼마입니까?'
q = '어느 양계장에서 하루에 평균 230 개의 달걀을 생산한다고 합니다. 15 일 동안에는 모두 몇 개의 달걀을 생산하겠습니까?'
q = '정국이와 지민이의 평균 몸무게는 39kg 이고, 유나의 몸무게는 36kg 입니다. 세 사람의 평균 몸무게는 몇 kg 입니까?'
q = '서로 다른 세 수가 있습니다. 서로 다른 두 수끼리의 평균이 각각 26.5, 34.5, 29 일 때, 세 수의 평균을 구하시오.'

q = '468/(13*6)을 계산하면 얼마입니까?'
q = '629cm 는 몇 m인지 소수로 나타내시오.'

q = '정국이네 반 학급 문고에는 동화책이 267권, 위인전이 312권 있습니다. 학급 문고에 있는 동화책과 위인전은 모두 몇 권입니까?'


q = '책장의 높이는 3/5m입니다. 책장의 높이는 몇 m인지 구하시오.'
q = '15초과 40미만인 자연수 중에서 3으로 나누어 떨어지는 수는 모두 몇 개입니까?'
q = '15초과 40미만인 자연수 중에서 30보다 큰 수는 모두 몇 개입니까?'
q = '5개의 수 1.4, 9/10, 1.1, 0.5, 13/10이 있습니다. 이 중에서 0.9보다 큰 수는 모두 몇 개입니까?'
q = '15초과 40미만인 자연수가 있습니다. 이 중에서 가장 작은 수는 무엇입니까?'
q = '5개의 수 2, 5, 8, 12, 16이 있습니다. 이 중에서 3으로 나누어 떨어지는 수는 모두 몇 개입니까?'
q = '5개의 수 2, 5, 8, 12, 16이 있습니다. 이 중에서 2보다 크고 10보다 작은 수는 모두 몇 개입니까?'
q = '15초과 40미만인 자연수 중에서 가장 큰 수와 가장 작은 수의 곱은 얼마입니까?'

q = '한 상자에는 감이 100개씩 들어있습니다. 6개의 상자 안에 있는 감은 모두 몇 개일까요?'
q = 'A를 8로 나누면 몫은 B이고 나머지는 C가 됩니다. A, B, C는 자연수입니다. 이 식에서 몫과 나머지가 같습니다. 나누어지는 수 A 중 가장 큰 수를 구하시오.'
q = '(가), (나), (다), (라) 4개의 상자가 있습니다. (나) 상자는 (라) 상자보다 큽니다. (가) 상자는 (라) 상자보다 작습니다. (나) 상자는 (다) 상자보다 작습니다. 크기가 가장 작은 상자는 무엇입니까?'
q = '1, 5, 14, 30, 55, 91과 같은 규칙으로 수를 배열하고 있습니다. 9번째 수는 무엇입니까?'
q = 'A=645+786, B=597+835일 때, A와 B중에서 큰 수는 무엇입니까?'

q = '지민이의 하루 식사 시간은 24시간 중에서 1/6만큼입니다. 정국이의 하루 식사 시간은 24시간 중에서 1/8만큼입니다. 누구의 식사 시간이 더 짧습니까?'

q = '백의 자리가 9, 십의 자리가 4, 일의 자리가 1인 세 자리 수보다 274 큰 수를 구하시오.'
q = '승기와 윤하가 각각 1l 인 우유를 어림하였습니다. 승기는 940ml, 윤하는 1080ml가 나왔을 때, 실제와 더 가깝게 어림한 사람은 누구입니까?'
q = '승우는 종이학 3 마리를 접는 데 138 초가 걸립니다. 승우가 종이학 18 마리를 접는 데 걸리는 시간은 몇 분 몇 초입니까?'
q = '4개에 3200 원 하는 사과가 있습니다. 사과 15개를 사려면 얼마의 돈이 필요합니까?'
q = '물통에 물이 3l 350ml 들어 있습니다. 이 물통에 4860ml 의 물을 더 부으면 물의 양은 모두 몇 ml가 되겠습니까?'
q = '주전자의 들이는 2l 300ml이고, 어항의 들이는 6l 750ml일 때, 주전자와 어항의 들이의 합은 몇 ml 입니까?'
q = '상자 안에 9개의 공이 있습니다. 석진이가 5개의 공을 상자 안에 더 넣었습니다. 상자 안에 있는 공은 모두 몇 개입니까?'
q = '정국이 책가방의 무게는 1400g 이고, 유나이 책가방의 무게는 2 kg 100g 입니다. 누구의 책가방이 더 가볍습니까?'
q = '정국이는 1.05km 를 달렸고, 유나는 정국이보다 460m 더 적게 달렸습니다. 유나는 몇 km를 달렸습니까?'
q = '어떤 두 수의 최대공약수가 16 입니다. 이 두 수의 모든 공약수의 합을 구하시오.'

q = '서진이는 전체 쪽수가 224쪽인 동화책을 모두 읽으려고 합니다. 하루에 58쪽씩 읽으면 며칠 안에 모두 읽을 수 있습니까?'



q = '2에 어떤 수를 곱해야 할 것을 잘못하여 5에 어떤 수를 곱했더니 40이 되었습니다. 바르게 계산하면 얼마인지 구하시오.'
q = '어떤 수에서 46을 뺐더니 15가 되었습니다. 어떤 수에서 29를 빼면 얼마가 되는지 구하시오.'
q = '29보다 어떤 수만큼 큰 수는 41입니다. 어떤 수보다 8 큰 수는 얼마입니까?'
q = '어떤 수에서 3을 뺀 값은 25보다 작습니다. 어떤 수는 10보다 큽니다. 어떤 수는 모두 몇 개입니까?'
q = '5와 어떤 수를 모았더니 6이 되었습니다. 어떤 수는 얼마입니까?'
q = '어떤 수에 90을 곱하였더니 45000이 되었습니다. 어떤 수는 얼마입니까?'
q = '어떤 수를 25로 나누었더니 몫이 16이고 나머지가 11이었습니다. 어떤 수는 얼마입니까?'
q = '어떤 수에 57을 곱해야 할 것을 잘못하여 57로 나누었더니 몫이 13이고 나머지가 8이 되었습니다. 바르게 계산하면 얼마인지 구해 보세요.'
q = '30 을 어떤 수로 나누면 나머지가 3 입니다. 어떤 수는 모두 몇 개입니까?'

q = '20명의 학생들이 한 줄로 줄을 섰습니다. 윤기의 앞에 11명의 학생들이 서 있습니다. 윤기의 뒤에 서 있는 학생은 몇 명입니까?'
q = '키가 작은 사람부터 순서대로 9명이 한 줄로 서 있습니다. 정국이가 앞에서부터 2번째에 서 있습니다. 키가 큰 사람부터 순서대로 다시 줄을 서면 정국이는 앞에서부터 몇 번째에 서게 됩니까?'
q = '사과, 복숭아, 배, 참외 중에서 2가지의 과일을 골라서 사는 경우는 모두 몇 가지입니까?'
q = '노란색, 파란색, 빨간색, 녹색, 검정색 중에서 3가지의 색깔을 고르는 경우는 모두 몇 가지입니까?'

q = '세 자리 수 A가 있을 때, 921-535>534-A이고 538-A>921-535입니다. 가장 큰 A의 값을 구하시오.'
q = '835-476>642-A, 548-A>732-475를 모두 만족하는 세 자리 수 A는 모두 몇 개입니까?'
q = '778+22A>1003일 때, 0 부터 9 까지의 수 A 중에서 가장 작은 수를 구해 보시오.'
q = '네 자리 수 A가 있을 때, 이 중에서 가장 큰 수와 작은 수의 합을 구해 보시오.'

q = '숫자 카드 2, 0, 4, 9, 7을 한 번씩만 써서 가장 작은 다섯 자리 수를 만들어 보시오.'

q = '지민이네 반 학생 40 명이 현장 학습을 가기 위해 버스를 타려고 합니다. 버스 요금이 450 원이라면 모두 얼마를 내야 합니까?'

q = '정국이의 아버지와 어머니의 나이 차는 4 살이고 두 분의 나이를 곱하면 1596 입니다. 아버지와 어머니의 나이의 합을 구하시오.'
q = '30의 약수는 모두 몇 개인가요?'
q = '45 의 약수 중에서 가장 작은 수와 가장 큰 수의 차를 구하시오.'
q = '12 와 18의 공약수들의 합을 구하시오.'
q = '1 이 아닌 어떤 수로 56 과 84 를 나누면 나누어떨어진 다고 합니다. 어떤 수들의 합을 구하시오.'

q = '정국이의 아버지께서는 중국으로 출장을 가시기 전에 환전하려고 합니다. 환전하는 날의 환율은 우리나라 돈 1000 원이 중국 돈 5.94 위안일 때 우리나라 돈 90000 원으로 환전할 수 있는 중국 돈은 몇 위안인지 구하시오.'
q = '정국이는 12일 동안 288쪽의 책을 읽었고, 지민이는 9일 동안 243쪽의 책을 읽었습니다. 하루 동안 누가 더 읽었습니까?'
q = '지민, 정국, 태형이의 수학 점수는 각각 94점, 82점, 88점입니다. 이 셋을 제외한 학급의 수학 점수 평균은 78점입니다. 지민이네 학급 인원수가 30명일 때, 학급 수학 평균 점수는 몇 점입니까?'
q = '100개의 사탕을 태형, 남준, 윤기 3명에게 순서대로 2개씩 나누어 줍니다. 91번째 사탕을 받는 사람은 누구입니까?'
q = '어떤 수를 1/100배 해야 할 것을 잘못하여 10 배 하였더니 280 가 되었습니다. 바르게 계산하면 얼마입니까?'
q = '어떤 수의 10배는 170입니다. 어떤 수의 1/100배는 얼마입니까?'

q = '5개의 수 1.4, 9/10, 1.1, 0.5, 13/10이 있습니다. 이 중에서 0.9보다 큰 수는 모두 몇 개입니까?'

q = '1, 5, 14, 30, 55, 91과 같은 규칙으로 수를 배열하고 있습니다. 5는 몇 번째에 있습니까?'
q = '4개의 수 1, 2, 3, 4가 있습니다. 1은 오른쪽에서부터 몇 번째에 있습니까?'

q = '5.480에서 소수 셋째 자리 숫자는 무엇입니까?'
q = '145.28 에서 소수 첫째 자리 숫자는 몇입니까?'
q = '1이 5개, 0.1이 2개, 0.01이 7개, 0.001이 8개인 수는 얼마입니까?'

q = '10000은 9950보다 A만큼 큰 수입니다. A의 값을 구하시오.'
q = '917-353=A일 때, A의 값은 얼마입니까?'
q = 'AAA+1BB=B10일 때, A와 B의 차를 구하시오.'
q = '5A9+37B=C24에서, A의 값을 구하시오.'
q = 'AAA+1BB=B10일 때, B에서 A를 뺀 값은?'
q = '40에서 어떤 수를 뺐더니 12가 되었습니다. 30에서 어떤 수를 더하면 얼마입니까?'

q = '(가), (나), (다), (라) 4개의 상자가 있습니다. (나) 상자는 (라) 상자보다 큽니다. (가) 상자는 (라) 상자보다 작습니다. (나) 상자는 (다) 상자보다 작습니다. 크기가 가장 큰 상자는 무엇입니까?'
q = '일의 자리 숫자가 8 , 소수 첫째 자리 숫자가 5 , 소수 둘째 자리 숫자가 2 인 소수 두 자리 수의 100 배는 얼마입니까?'

q = '0.01이 273개인 수는 얼마입니까?'
q = '진수와 경민이는 오늘부터 꽃길 만들기를 시작합니다. 하루에 진수는 전체 일의 5/16를, 경민이는 전체 일의 3/16을 한다면 진수와 경민이가 함께 꽃길 만들기 했을 때 며칠 만에 모두 끝낼 수 있습니까?'
q = '어떤 수에서 8 을 뺀 값은 5 와 7 의 곱에 12 를 더한 값과 같습니다. 어떤 수는 얼마인지 구하시오.'
q = '철사를 47 도막으로 자르려고 합니다. 철사를 한 번 자르는 데 5 초가 걸린다면, 쉬지 않고 47 도막으로 자르는 데 모두 몇 초가 걸리겠습니까?'
q = '쿠키를 유정이는 8개 먹었고, 유나는 유정이보다 1개 더 많이 먹었습니다. 유정이가 먹은 쿠키는 몇 개입니까?'

q = '2부터 200까지의 짝수의 합은 구하시오.'
q = '2부터 200까지의 짝수의 합은 얼마입니까?'
q = '똑같은 구슬 12개가 들어 있는 상자의 무게를 재어 보니 444g이었습니다. 상자만의 무게가 60g이라면 구슬 한 개의 무게는 몇 g입니까?'
load_dataset()
print(f'\033[92mQ: {q}\033[0;0m')
answer, derivation = solver(q)
print(f'\033[33mA: {answer}\033[0;0m')
code = '\n'.join(derivation)
print(f'\033[33mderivation:\n{code}\033[0;0m')
env = dict()
exec(code, env, env)

# %%

generate_parse(q)

# %%

test = get_predefined_candidates_nodes('(가), (나), (다), (라) 4개의 상자가 있습니다.')
for t in test:
    print(f'{t.raw} {t.span} {t.reduce} {t.statements}')
# %%
